app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト投稿"], ["content", "今日もお疲れさま！"], ["user_id", 1], ["created_at", "2025-01-05 05:50:30.650293"], ["updated_at", "2025-01-05 05:50:30.650293"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @posts = Post.limit(10).order(created_at: :desc)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.user == current_user
      @post.destroy