app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "description", "deadline", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["deadline", "2025-01-05"], ["status", 0], ["created_at", "2025-01-05 12:46:37.834040"], ["updated_at", "2025-01-05 12:46:37.834040"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "description" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "test2"], ["updated_at", "2025-01-05 12:46:54.112553"], ["id", 2]]